{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer_26": {"name": "input_layer_26:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1024"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_26_1/dense_131_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_131_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_130_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1024"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_130_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_132_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_132_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_133_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_133_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_134_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_134_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer_26", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "1024"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_130_1/BiasAdd", "op": "_FusedMatMul", "input": ["input_layer_26", "StatefulPartitionedCall/functional_26_1/dense_130_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_26_1/dense_130_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "1024"}]}, {"dim": [{"size": "1024"}, {"size": "512"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_26_1/dense_130_1/BiasAdd", "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/activation_104_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_131_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_26_1/activation_104_1/Relu", "StatefulPartitionedCall/functional_26_1/dense_131_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_26_1/dense_131_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "512"}]}, {"dim": [{"size": "512"}, {"size": "512"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_26_1/dense_131_1/BiasAdd", "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/activation_105_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/add_26_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_26_1/activation_105_1/Relu", "StatefulPartitionedCall/functional_26_1/activation_104_1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_132_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_26_1/add_26_1/Add", "StatefulPartitionedCall/functional_26_1/dense_132_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_26_1/dense_132_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "512"}]}, {"dim": [{"size": "512"}, {"size": "256"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_26_1/dense_132_1/BiasAdd", "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/activation_106_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_133_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_26_1/activation_106_1/Relu", "StatefulPartitionedCall/functional_26_1/dense_133_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_26_1/dense_133_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "_input_shapes": {"list": {"shape": [{"dim": [{"size": "-3"}, {"size": "256"}]}, {"dim": [{"size": "256"}, {"size": "128"}]}]}}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_26_1/dense_133_1/BiasAdd", "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/activation_107_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_134_1/Sigmoid", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_26_1/activation_107_1/Relu", "StatefulPartitionedCall/functional_26_1/dense_134_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_26_1/dense_134_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "U2lnbW9pZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_26_1/dense_134_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/functional_26_1/dense_131_1/Cast/ReadVariableOp", "shape": [512, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.08642518894345153, "scale": 0.0006969773301891252, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_131_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.0349512659081752e-05, "scale": 1.9018236129982945e-07, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/mul", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.6425611972808838, "scale": 0.003993812261843214, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_105_1/batchnorm/sub", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.9252521991729736, "scale": 0.008411383628845215, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_130_1/Cast/ReadVariableOp", "shape": [1024, 512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.07961924298136841, "scale": 0.0006269231730816411, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_130_1/BiasAdd/ReadVariableOp", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.6271987849659305e-05, "scale": 2.455325967257879e-07, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/mul", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.2566533386707306, "scale": 0.005183420812382418, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_104_1/batchnorm/sub", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.02147780512185658, "scale": 0.00017182244097485263, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_132_1/Cast/ReadVariableOp", "shape": [512, 256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.09872391048599692, "scale": 0.0007835230990952136, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_132_1/BiasAdd/ReadVariableOp", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -2.2354571025489883e-05, "scale": 1.8027879859266035e-07, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/mul", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.4423399865627289, "scale": 0.002086512130849502, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_106_1/batchnorm/sub", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.158573857943217, "scale": 0.009735914772632075, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_133_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.13972556345603046, "scale": 0.001083143902759926, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_133_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -4.472496334974672e-05, "scale": 2.79531020935917e-07, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/mul", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.8398449420928955, "scale": 0.002628030028997683, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/batch_normalization_107_1/batchnorm/sub", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -1.2060875658895456, "scale": 0.009277596660688812, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_134_1/Cast/ReadVariableOp", "shape": [128, 1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": -0.22271350446869345, "scale": 0.0017536496414857752, "original_dtype": "float32"}}, {"name": "StatefulPartitionedCall/functional_26_1/dense_134_1/Add/ReadVariableOp", "shape": [1], "dtype": "float32", "quantization": {"dtype": "uint8", "min": 0.008958270773291588, "scale": 1.0, "original_dtype": "float32"}}]}]}